allie/Ada-Cooks-1/app/controllers/ingredients_controller.rb

  def create
    @ingredients = Ingredient.all
    @ingredient = Ingredient.new(params.require(:ingredient).permit(:name))
    if @ingredient.save
---
SELECT "ingredients".* FROM "ingredients"
INSERT INTO "ingredients" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-05 23:28:12.420795"], ["name", "chocolate"], ["updated_at", "2014-11-05 23:28:12.420795"]]

  def edit
    @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @ingredient = Ingredient.find(params[:id])
    if @ingredient.update(params.require(:ingredient).permit(:name))
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "ingredients" SET "name" = $1, "updated_at" = $2 WHERE "ingredients"."id" = 1  [["name", "Chocolate "], ["updated_at", "2014-11-08 07:44:37.101400"]]

  def destroy
    @ingredient = Ingredient.find(params[:id])
    if @ingredient.destroy
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = $1  [["id", 6]]