allie/Ada-Cooks-1/app/controllers/recipes_controller.rb

  def create
    raise
    @recipe = Recipe.new(params.require(:recipe).permit(:name, :directions))
    if @recipe.save
---
INSERT INTO "recipes" ("created_at", "directions", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-05 23:08:51.522935"], ["directions", "Mix orange juice and champagne.  Drink."], ["name", "Mimosa"], ["updated_at", "2014-11-05 23:08:51.522935"]]