allie/Ada-Cooks-1/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
SELECT "ingredients".* FROM "ingredients"
---
  def index
    @recipes = Recipe.all
    @ingredients = Ingredient.all

SELECT "ingredients".* FROM "ingredients"
---
  def new
    @recipe = Recipe.new
    @ingredients = Ingredient.all

SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "ingredients".* FROM "ingredients"
---
  def edit
    @recipe = Recipe.find(params[:id])
    @ingredients = Ingredient.all

SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
---
  def update
    @recipe = Recipe.find(params[:id])

SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]
---
  def destroy
    @recipe = Recipe.find(params[:id])
    if @recipe.destroy